# Python Intro - Final Exercise

In [1]:
import pyodbc
import pandas as pd
import numpy as np

In [2]:
### In windows, Using a ODBC DNS (predefined connection name)
import pyodbc
conn = pyodbc.connect ("DSN=College;"
                      "Server=DESKTOP-AAGNMGA\SQLEXPRESS;"
                      "Database=College;"
                      "Trusted_Connection=yes;")

In [3]:
### Get the students table
students = pd.read_sql("SELECT * FROM Students;",conn)
students.head()

   StudentId FirstName   LastName Gender
0      162.0    Elmira    Holston      F
1      154.0    Sierra  Van Vorst      F
2       28.0     Mycah    Bingham      F
3       54.0      Alia      Jones      F
4       31.0    Chanda   Fillmore      F

In [4]:
departments = pd.read_sql("SELECT * FROM Departments;",conn)
departments.head()

   DepartmentId DepartmentName
0           1.0        English
1           2.0        Science
2           3.0           Arts
3           4.0          Sport

In [5]:
courses = pd.read_sql("SELECT * FROM Courses;",conn)
courses.head()

   CourseId            CourseName  DepartmentId  TeacherId
0       1.0     English Begginers           1.0       15.0
1       2.0      Advanced English           1.0       15.0
2       3.0  Proffesional English           1.0       15.0
3       4.0       Mathematics 101           2.0        2.0
4       5.0   Matematics Advanced           2.0       13.0

In [6]:
classrooms = pd.read_sql("SELECT * FROM Classrooms;",conn)
classrooms.head()

   CourseId  StudentId     degree
0       1.0      202.0  92.031070
1       1.0       12.0  81.175916
2       1.0      232.0  82.396587
3       1.0      123.0  62.420449
4       1.0      274.0  72.569900

In [7]:
teachers = pd.read_sql("SELECT * FROM Teachers;",conn)
teachers.head()

   TeacherId   FirstName  LastName Gender
0        1.0      Kaylea  Monzingo      F
1        2.0      Amanda   Dworkin      F
2        3.0      Jordyn     Baron      F
3        4.0   Katherine    Dibari      F
4        5.0     Heather   Metcalf      F

# Questions
 
 
## Q1. Count the number of students on each department

In [8]:
Q1 = classrooms.merge(courses, on = 'CourseId').merge(departments, on='DepartmentId')
Q1.head()

,CourseId,StudentId,degree,CourseName,DepartmentId,TeacherId,DepartmentName
0,1.0,202.0,92.031070,English Begginers,1.0,15.0,English
1,1.0,12.0,81.175916,English Begginers,1.0,15.0,English
2,1.0,232.0,82.396587,English Begginers,1.0,15.0,English
3,1.0,123.0,62.420449,English Begginers,1.0,15.0,English
4,1.0,274.0,72.569900,English Begginers,1.0,15.0,English

In [9]:
Q1.groupby('DepartmentName').agg({'StudentId':pd.Series.nunique})

                StudentId
DepartmentName
Arts                137.0
English              84.0
Science             200.0
Sport                81.0

## Q2. How many students have each course of the English department and the total number of students in the department?

In [10]:
Q1[(Q1.DepartmentId.isin([1]))].\
    groupby('CourseName').\
    agg({'StudentId':pd.Series.nunique})

                      StudentId
CourseName
Advanced English           24.0
English Begginers          32.0
Proffesional English       38.0

In [11]:
Q1[(Q1.DepartmentId.isin([1]))].\
    groupby('DepartmentName').\
    agg({'StudentId':pd.Series.nunique})

                StudentId
DepartmentName
English              84.0

## Q3. How many small (<22 students) and large (22+ students) classrooms are needed for the Science department?

In [12]:
Q3 = Q1[(Q1.CourseId.between(4,19))].\
    groupby(['DepartmentName','CourseName']).\
    agg({'StudentId':pd.Series.nunique})
Q3["ClassSize"]='Small Class'
Q3.loc[Q3["StudentId"]>22,"ClassSize"]='Big Class'
Q3

                                    StudentId    ClassSize
DepartmentName CourseName
Science        Algebra                   12.0  Small Class
               Biology                   36.0    Big Class
               Chemistry                 23.0    Big Class
               Computer Science          38.0    Big Class
               Data Science              30.0    Big Class
               Genetics                  37.0    Big Class
               Geometry                  13.0  Small Class
               Java                      16.0  Small Class
               Matematics Advanced       10.0  Small Class
               Mathematics 101           18.0  Small Class
               Neurobiology              24.0    Big Class
               Physics                   12.0  Small Class
               Python                    23.0    Big Class
               R                         33.0    Big Class
               SQL                       24.0    Big Class
               Statistics                24.0    Big Class

In [13]:
Q3.groupby('ClassSize').agg({'ClassSize':'count'})

             ClassSize
ClassSize
Big Class           10
Small Class          6

## Q4. A feminist student claims that there are more male than female in the College. Justify if the argument is correct

In [14]:
students.groupby('Gender').agg({'Gender':'count'})

        Gender
Gender
F          165
M          115

## Q5. For which courses the percentage of male/female students is over 70%?

In [15]:
Q5 = classrooms.merge(students, on = 'StudentId', how='left').merge(courses, on='CourseId', how='left')
Q5.head()

,CourseId,StudentId,degree,FirstName,LastName,Gender,CourseName,DepartmentId,TeacherId
0,1.0,202.0,92.031070,Autumn,Major,F,English Begginers,1.0,15.0
1,1.0,12.0,81.175916,Sophiya,Aponte,F,English Begginers,1.0,15.0
2,1.0,232.0,82.396587,Victoria,Kishinevsky,F,English Begginers,1.0,15.0
3,1.0,123.0,62.420449,Kelsi,Taber,F,English Begginers,1.0,15.0
4,1.0,274.0,72.569900,Samantha,Anderson,F,English Begginers,1.0,15.0

In [16]:
over_70per = Q5.groupby(['CourseName','Gender']).\
            agg({'Gender':'count'}) / Q5.groupby(['CourseName']).agg({'Gender':'count'})

In [17]:
over_70per[(over_70per.Gender.between(0.7001,1))].\
            groupby(['CourseName']).\
            agg({'Gender':[min]})

              Gender
                 min
CourseName
Sculpture   0.708333
Tenis       0.722222

## Q6. For each department, how many students passed with a grades over 80?

In [18]:
Above80=Q1[Q1.degree.between(80,100)].\
        groupby(['DepartmentName']).\
        agg({'StudentId':pd.Series.nunique}) /Q1.groupby(['DepartmentName']).agg({'StudentId':pd.Series.nunique})*100
Above80

                StudentId
DepartmentName
Arts            44.525547
English         47.619048
Science         61.000000
Sport           48.148148

## Q7. For each department, how many students passed with a grades under 60?

In [19]:
Under60=Q1[Q1.degree.between(0,60)].\
        groupby(['DepartmentName']).\
        agg({'StudentId':pd.Series.nunique}) /Q1.groupby(['DepartmentName']).agg({'StudentId':pd.Series.nunique})*100
Under60

                StudentId
DepartmentName
Arts             2.189781
English          2.380952
Science          3.500000
Sport            1.234568

## Q8. Rate the teachers by their average student's grades (in descending order).

In [20]:
Q8= classrooms.merge(courses, on = 'CourseId').merge(teachers, on='TeacherId')
Q8['TeacherName'] = Q8['FirstName'] + ' ' + Q8['LastName']

In [21]:
Q8.groupby(['TeacherName',]).\
agg({'degree':'mean'}).sort_values(by='degree', ascending=False)

                       degree
TeacherName
 Darick Hess        81.432703
 Jordyn Baron       80.729494
 Heather Metcalf    80.440242
 Zachary Healy      79.365867
 Kaylea Monzingo    79.365537
 Daniel Bland       78.908281
 Keegan Price       78.814631
 Conor Mckittrick   78.699492
 Maxwell Romkee     78.673509
 Terran Beaty       78.495479
 Tanner Fitzsimons  78.443395
 Mackenzie Olsen    78.383348
 Ernest Stoyanov    78.316150
 Madison Batan      77.743575
 Katerina Young     77.406852
 Mikayla Russell    77.134323
 Amanda Dworkin     76.899881
 Kaitlin Delude     76.765296
 Jeffrey Batzel     76.737973
 Robert Aivazian    76.516464
 Caroline Knuesel   75.955453
 Alexander Watts    75.668139

## Q9. Create a dataframe showing the courses, departments they are associated with, the teacher in each course, and the number of students enrolled in the course (for each course, department and teacher show the names).

In [22]:
Q9 = courses.merge(departments, on = 'DepartmentId', how='left').\
             merge(classrooms, on='CourseId', how='left').\
             merge(teachers, on='TeacherId', how='left')

In [23]:
Q9.groupby(['CourseId','CourseName','DepartmentName','FirstName','LastName']).\
   agg({'StudentId':pd.Series.nunique})

                                                                      StudentId
CourseId CourseName           DepartmentName FirstName  LastName
1.0      English Begginers    English         Conor     Mckittrick         32.0
2.0      Advanced English     English         Conor     Mckittrick         24.0
3.0      Proffesional English English         Conor     Mckittrick         38.0
4.0      Mathematics 101      Science         Amanda    Dworkin            18.0
5.0      Matematics Advanced  Science         Alexander Watts              10.0
6.0      Algebra              Science         Alexander Watts              12.0
7.0      Geometry             Science         Alexander Watts              13.0
8.0      Chemistry            Science         Jeffrey   Batzel             23.0
9.0      Physics              Science         Alexander Watts              12.0
10.0     Biology              Science         Jordyn    Baron              36.0
11.0     Genetics             Science         Terran    Beaty              37.0
12.0     Neurobiology         Science         Terran    Beaty              24.0
13.0     Statistics           Science         Heather   Metcalf            24.0
14.0     Computer Science     Science         Kaylea    Monzingo           38.0
15.0     Data Science         Science         Mackenzie Olsen              30.0
16.0     SQL                  Science         Zachary   Healy              24.0
17.0     Python               Science         Terran    Beaty              23.0
18.0     R                    Science         Tanner    Fitzsimons         33.0
19.0     Java                 Science         Darick    Hess               16.0
20.0     History of Arts      Arts            Caroline  Knuesel            32.0
21.0     Painting             Arts            Katerina  Young              34.0
22.0     Sculpture            Arts            Robert    Aivazian           23.0
23.0     Musicology           Arts            Madison   Batan              30.0
24.0     Theater              Arts            Ernest    Stoyanov           26.0
25.0     Literature           Arts            Daniel    Bland              39.0
26.0     Basketball           Sport           Katherine Dibari              0.0
27.0     Volleyball           Sport           Kaitlin   Delude             36.0
28.0     Football             Sport           Cortnee   Kinderknecht        0.0
29.0     Tenis                Sport           Keegan    Price              18.0
30.0     Swimming             Sport           Mikayla   Russell            18.0
31.0     Gymnastics           Sport           Maxwell   Romkee             22.0

## Q10. Create a dataframe showing the students, the number of courses they take, the average of the grades per class, and their overall average (for each student show the student name).

In [51]:
Q10 = students.merge(classrooms, on = 'StudentId', how='left').\
               merge(courses, on='CourseId', how='left')
Q10.head()

,StudentId,FirstName,LastName,Gender,CourseId,degree,CourseName,DepartmentId,TeacherId
0,162.0,Elmira,Holston,F,8.0,65.987050,Chemistry,2.0,14.0
1,162.0,Elmira,Holston,F,20.0,79.476271,History of Arts,3.0,8.0
2,162.0,Elmira,Holston,F,31.0,74.546820,Gymnastics,4.0,23.0
3,154.0,Sierra,Van Vorst,F,6.0,84.137367,Algebra,2.0,13.0
4,154.0,Sierra,Van Vorst,F,18.0,81.048019,R,2.0,17.0

In [52]:
Overall_Average = Q10.groupby(['StudentId','FirstName','LastName']).\
                      agg({'CourseId':pd.Series.nunique,'degree':'mean'})
Overall_Average.reset_index(inplace=True)
Overall_Average.head()

   StudentId    FirstName LastName  CourseId     degree
0        1.0   Alexandria   Heller       4.0  81.337515
1        2.0       Cassie    Liska       5.0  79.137364
2        3.0       Hayley    Frank       3.0  78.793700
3        4.0      Maxwell    Kotch       3.0  71.481003
4        5.0        Dylan    Boehm       3.0  76.718650

In [53]:
Q10['Average']='English_Degree'
Q10.loc[Q10['DepartmentId']==2,'Average']='Science_Degree'
Q10.loc[Q10['DepartmentId']==3,'Average']='Art_Degree'
Q10.loc[Q10['DepartmentId']==4,'Average']='Sport_Degree'

DepartmentAvg = Q10.groupby(['StudentId','FirstName','LastName','DepartmentId','Average']).agg({'CourseId':pd.Series.nunique,'degree':'mean'})

DepartmentAvg.head()

# 4 DF.       LEFT JIONT

                                                            CourseId  \
StudentId FirstName   LastName DepartmentId Average
1.0        Alexandria Heller   2.0          Science_Degree       3.0
                               3.0          Art_Degree           1.0
2.0        Cassie     Liska    2.0          Science_Degree       3.0
                               3.0          Art_Degree           2.0
3.0        Hayley     Frank    1.0          English_Degree       1.0

                                                               degree
StudentId FirstName   LastName DepartmentId Average
1.0        Alexandria Heller   2.0          Science_Degree  79.557508
                               3.0          Art_Degree      86.677535
2.0        Cassie     Liska    2.0          Science_Degree  78.867115
                               3.0          Art_Degree      79.542738
3.0        Hayley     Frank    1.0          English_Degree  83.972245

In [71]:
Overall_Average.reindex(columns = np.append( Overall_Average.columns.values, ['English_Degree','Science_Degree','Art_Dgree','Sport_Degree']))
#Overall_Average['English_Degree']=np.where(DepartmentAvg['DepartmentId']==1.0,np.mean,np.NaN)
#Overall_Average.loc[Q10['DepartmentId']==1,'English_Degree'] = Q10.groupby(['StudentId']).agg({'degree':'mean'})
#Overall_Average.loc[Q10['DepartmentId']==2,'Art_Degree'] = Q10.groupby(['StudentId','FirstName','LastName','DepartmentId','Average']).agg({'degree':'mean'})
#Overall_Average.loc[Q10['DepartmentId']==3,'Science_Degree'] = Q10.groupby(['StudentId','FirstName','LastName','DepartmentId','Average']).agg({'degree':'mean'})
#Overall_Average.loc[Q10['DepartmentId']==4,'Sport_Degree'] = Q10.groupby(['StudentId','FirstName','LastName','DepartmentId','Average']).agg({'degree':'mean'})
Overall_Average

,StudentId,FirstName,LastName,CourseId,degree,English_Degree,Art_Degree,Science_Degree,Sport_Degree
0,1.0,Alexandria,Heller,4.0,81.337515,NaN,NaN,NaN,NaN
1,2.0,Cassie,Liska,5.0,79.137364,NaN,NaN,NaN,NaN
2,3.0,Hayley,Frank,3.0,78.793700,NaN,NaN,NaN,NaN
3,4.0,Maxwell,Kotch,3.0,71.481003,NaN,NaN,NaN,NaN
4,5.0,Dylan,Boehm,3.0,76.718650,NaN,NaN,NaN,NaN
5,6.0,Chelsea,Vuolo,2.0,71.578832,NaN,NaN,NaN,NaN
6,7.0,Katrina,Evers,4.0,73.325298,NaN,NaN,NaN,NaN
7,8.0,Sean,Hasenack,3.0,88.198366,NaN,NaN,NaN,NaN
8,9.0,Madalyn,Miller,2.0,86.802830,NaN,NaN,NaN,NaN
9,10.0,Katrina,Miller,4.0,80.622716,NaN,NaN,NaN,NaN
10,11.0,Rachael,Williams,3.0,72.498837,NaN,NaN,NaN,NaN
11,12.0,Sophiya,Aponte,4.0,78.810949,NaN,NaN,NaN,NaN
12,13.0,Elijah,Hogan,2.0,72.625824,NaN,NaN,NaN,NaN
13,14.0,Rossi,Panelli,0.0,NaN,NaN,NaN,NaN,NaN
14,15.0,Catherine,Sturgeon,5.0,71.333110,NaN,NaN,NaN,NaN
15,16.0,Anina,Meneses,4.0,80.807665,NaN,NaN,NaN,NaN
16,17.0,Cody,Dawkins,3.0,77.610780,NaN,NaN,NaN,NaN
17,18.0,Austin,Power,4.0,80.507924,NaN,NaN,NaN,NaN
18,19.0,Devin,Tolstykh,2.0,81.012028,NaN,NaN,NaN,NaN
19,20.0,Darby,Cobb,4.0,83.136309,NaN,NaN,NaN,NaN
20,21.0,Kayla,Cameron,5.0,78.473818,NaN,NaN,NaN,NaN
21,22.0,Alexandrea,Hannafious,3.0,86.967607,NaN,NaN,NaN,NaN
22,23.0,Angela,Palermo,2.0,83.056965,NaN,NaN,NaN,NaN
23,24.0,Sarah,Reilly-Vessey,3.0,81.478192,NaN,NaN,NaN,NaN
24,25.0,Morgan,Wikowsky,1.0,97.843102,NaN,NaN,NaN,NaN
25,26.0,Kyle,Shepler,4.0,88.004833,NaN,NaN,NaN,NaN
26,27.0,Shawn,Foster,4.0,80.747526,NaN,NaN,NaN,NaN
27,28.0,Mycah,Bingham,5.0,77.734532,NaN,NaN,NaN,NaN
28,29.0,Chance,Mcdonough,4.0,83.200990,NaN,NaN,NaN,NaN
29,30.0,Kyle,Nibbelink,3.0,84.489712,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...
250,251.0,Heather,Williams,4.0,81.211582,NaN,NaN,NaN,NaN
251,252.0,Kori,Roper,5.0,76.321382,NaN,NaN,NaN,NaN
252,253.0,Ruben,Mosher,3.0,87.563619,NaN,NaN,NaN,NaN
253,254.0,Victoria,Wert,1.0,75.884974,NaN,NaN,NaN,NaN
254,255.0,Derrick,Mayberry,4.0,77.103957,NaN,NaN,NaN,NaN
255,256.0,Kristina,Heline,0.0,NaN,NaN,NaN,NaN,NaN
256,257.0,Nicholas,Roth,5.0,87.217715,NaN,NaN,NaN,NaN
257,258.0,Christian,Boucher,4.0,86.412261,NaN,NaN,NaN,NaN
258,259.0,Taiahbeth,Gerard,1.0,78.695946,NaN,NaN,NaN,NaN
259,260.0,Samantha,Untiedt,2.0,75.696286,NaN,NaN,NaN,NaN
260,261.0,Jordan,Tapp,0.0,NaN,NaN,NaN,NaN,NaN
261,262.0,Luke,Van Cleave,1.0,78.336991,NaN,NaN,NaN,NaN
262,263.0,Kara,Sedlak,5.0,75.549925,NaN,NaN,NaN,NaN
263,264.0,Mitchell,Fiore,0.0,NaN,NaN,NaN,NaN,NaN
264,265.0,Hannah,Anttila,3.0,77.499552,NaN,NaN,NaN,NaN
265,266.0,Maria,Gaddis,2.0,70.008043,NaN,NaN,NaN,NaN
266,267.0,Catherine,Lemme,4.0,82.657117,NaN,NaN,NaN,NaN
267,268.0,Lauren,Salazar,2.0,79.869976,NaN,NaN,NaN,NaN
268,269.0,Tyler,Raymond,4.0,77.639674,NaN,NaN,NaN,NaN
269,270.0,Brooke,Bishop,4.0,77.337873,NaN,NaN,NaN,NaN
270,271.0,Mckayla,Greaser,2.0,88.463635,NaN,NaN,NaN,NaN
271,272.0,Jennifer,Smith,3.0,79.947686,NaN,NaN,NaN,NaN
272,273.0,Kenneth,Lemmon,3.0,73.334264,NaN,NaN,NaN,NaN
273,274.0,Samantha,Anderson,1.0,72.569900,NaN,NaN,NaN,NaN
274,275.0,Elise,Ohler,4.0,82.028830,NaN,NaN,NaN,NaN
275,276.0,Dylan,Bannister,3.0,76.784735,NaN,NaN,NaN,NaN
276,277.0,Bryan,Medina,6.0,80.482335,NaN,NaN,NaN,NaN
277,278.0,Sydney,Blas,3.0,75.359189,NaN,NaN,NaN,NaN
278,279.0,Samantha,Berend,0.0,NaN,NaN,NaN,NaN,NaN
279,280.0,Matthew,Mcgrath,4.0,76.621429,NaN,NaN,NaN,NaN